package JavaCore.Kurs14.Tema3;

public class Zadacha1 {
}
/*Пришло время добавить класс в финансовое приложение. Сейчас весь код описан в одном классе Praсtiсum: и
конвертация валют, и работа с тратами, и взаимодействие с пользователем. В таком коде становится сложно ориентироваться.
Вы уже разбили его на методы — с помощью классов можно сделать его ещё проще. Создайте пустой класс Converter.
Позже в нём будет храниться вся логика, связанная с конвертацией валют.

Мы создаем класс согласно нашим пакетам и папках - Zadacha1*/